Flow_Pass_Train/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            patch;
        nFaces          7222;
        startFace       302649;
    }
    inlet
    {
        type            patch;
        nFaces          180;
        startFace       309871;
    }
    outlet
    {
        type            patch;
        nFaces          180;
        startFace       310051;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       310231;
    }
    upperWall
    {
        type            patch;
        nFaces          1000;
        startFace       311231;
    }
    train
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8466;
        startFace       312231;
    }
)

// ************************************************************************* //
